#include <iostream>
using namespace std;

int main()
{
    /*
        Большой комментарий
    */
    cout << "Hello World!\n"; // Вывод сообщения
    setlocale(LC_ALL, "ru"); // Подгрузка кириллицы
    // Типы данных
    int number = 5; // Целочисленное число (4 байта) 32 * 10^3-1 ->21436... до 21436...; 
    short short_number = 110; // Целочисленное число (2 байта) -12487 до 12487
    long a = 100; // Целочисленное число (8 байт)

    // Вещественные
    float f = 10.02; // 4 байта
    double d = 12.03; // 8 байт

    bool logic = true; // Логический тип данных
    char sym = 's'; // Символьный тип данных
    string text = "Какая то строка";

    cout <<  short_number;
    cout << "Мне сегодня исполняется: " << number << endl;// Использование конкатинации

    // Основные математические операнды;
    // + - операции сложения;
    // - - операции вычитания
    // * - операции умножения
    // / - операции операции деления
    // % - остаток от деления

    int c = (number + 15) / 25;
    cout << c;
    float b = 12;

    // Условные конструкции: if, else и switch
    if (a > b)
    {
        // Тело условия
    }
    else if (a<b) {
        // Тело альтернативного условия
    }
    else {
        // Иначе
    }

    switch (a) {
    case 1:
        cout << "Я понедельник";
        break;
    case 2:
        cout << "Я вторник";
        break;
    default:
        cout << "Я хз кто я";
        break;
    }
    
    return 0;
}

/*
    Компиляция - процесс преобразования одного формата кода в другой
    Строгая типизация - строгая привязка к типам данных
    Низкоуровневость - достаточно близкое взаимодействие с памятью
*/
